
// ================================================================================================
// -*- C++ -*-
// File: ntb_utils.hpp
// Author: Guilherme R. Lampert
// Created on: 18/12/15
// Brief: Common internal use functions, types and structures of the NeoTweakBar library.
// ================================================================================================

#ifndef NEO_TWEAK_BAR_UTILS_HPP
#define NEO_TWEAK_BAR_UTILS_HPP

#include <cstddef>   // For std::size_t, basic types, etc
#include <cstring>   // For std::memcpy, std::strlen, etc
#include <utility>   // For std::swap, std::move
#include <algorithm> // For std::sort, std::min, std::max

#include <cmath> // tan
#include <cstdlib> // abs/malloc/free
#include <cstdio> // snprintf

//
// Overridable assert() macro for NTB:
//
#ifndef NTB_ASSERT
    #include <cassert>
    #define NTB_ASSERT assert
#endif // NTB_ASSERT

// ========================================================
// TODO
// ========================================================

#define NEO_TWEAK_BAR_CXX11_SUPPORTED 1
#define NEO_TWEAK_BAR_STD_STRING_INTEROP 1

// *** TEMP ***
#include <iostream>
#include <string>

#if NEO_TWEAK_BAR_CXX11_SUPPORTED
    // For std::is_pod, std::is_pointer, etc.
    #include <type_traits>
#endif // NEO_TWEAK_BAR_CXX11_SUPPORTED

//TODO c++98 compat!
#define NTB_DISABLE_COPY_ASSIGN(className) \
  private:                                 \
    className(const className &) = delete; \
    className & operator = (const className &) = delete

#define NTB_FINAL_CLASS    final
#define NTB_OVERRIDE       override
#define NTB_NULL           nullptr
#define NTB_CONSTEXPR_FUNC constexpr

//TODO TIDY; TEMP
#include <cstdio> // for the printf below
#define NTB_ERROR(message) std::printf("NTB ERROR: %s\n", message)

#if NEO_TWEAK_BAR_CXX11_SUPPORTED
    #define NTB_ALIGNED(expr, alignment) alignas(alignment) expr
#else // !C++11
    #if defined(__GNUC__) || defined(__clang__) // Clang & GCC
        #define NTB_ALIGNED(expr, alignment) expr __attribute__((aligned(alignment)))
    #elif defined(_MSC_VER) // Visual Studio
        #define NTB_ALIGNED(expr, alignment) __declspec(align(alignment)) expr
    #else // Unknown compiler
        #define NTB_ALIGNED(expr, alignment) expr /* hope for the best? */
    #endif // Compiler id switch
#endif // NEO_TWEAK_BAR_CXX11_SUPPORTED

//TODO need a custom allocator...
//
// Preferably, should get rid of these macros.
// Probably define class-level new/delete for the classes that get dynamically allocated.
//
#define NTB_NEW    new
#define NTB_DELETE delete

//FIXME stdint is not so widely available...
#include <cstdint>
#include <cstdlib>

namespace ntb
{

typedef std::uint8_t  UByte;
typedef std::int8_t   Int8;
typedef std::uint8_t  UInt8;

typedef std::int16_t  Int16;
typedef std::uint16_t UInt16;

typedef std::int32_t  Int32;
typedef std::uint32_t UInt32;

typedef std::int64_t  Int64;
typedef std::uint64_t UInt64;

typedef float         Float32;
typedef double        Float64;

#if NEO_TWEAK_BAR_CXX11_SUPPORTED
    static_assert(sizeof(UByte)   == 1, "Expected 8-bits  integer!");
    static_assert(sizeof(Int8)    == 1, "Expected 8-bits  integer!");
    static_assert(sizeof(UInt8)   == 1, "Expected 8-bits  integer!");
    static_assert(sizeof(Int16)   == 2, "Expected 16-bits integer!");
    static_assert(sizeof(UInt16)  == 2, "Expected 16-bits integer!");
    static_assert(sizeof(Int32)   == 4, "Expected 32-bits integer!");
    static_assert(sizeof(UInt32)  == 4, "Expected 32-bits integer!");
    static_assert(sizeof(Int64)   == 8, "Expected 64-bits integer!");
    static_assert(sizeof(UInt64)  == 8, "Expected 64-bits integer!");
    static_assert(sizeof(Float32) == 4, "Expected 32-bits float!");
    static_assert(sizeof(Float64) == 8, "Expected 64-bits float!");
#endif // NEO_TWEAK_BAR_CXX11_SUPPORTED

//TODO replace with user supplied callbacks!
template<typename T>
inline T * memAlloc(const std::size_t countInItems) //NOTE: should just crash if out of mem! we don't check for null return!!!
{
    NTB_ASSERT(countInItems != 0);
    return static_cast<T *>(std::malloc(countInItems * sizeof(T)));
}
inline void memFree(void * ptr)
{
    if (ptr != NTB_NULL)
    {
        std::free(ptr);
    }
}

inline bool stringsEqual(const char * a, const char * b)
{
    NTB_ASSERT(a != NTB_NULL && b != NTB_NULL);
    return std::strcmp(a, b) == 0;
}

//TODO make non-inline
inline int copyString(char * dest, int destSizeInChars, const char * source)
{
    NTB_ASSERT(dest != NTB_NULL);
    NTB_ASSERT(source != NTB_NULL);
    NTB_ASSERT(destSizeInChars > 0);

    // Copy until the end of source or until we run out of space in dest:
    char * ptr = dest;
